app/controllers/rooms_controller.rb

  def index
    rooms = Room.where("participant_1_id = ? AND participant_2_id < ?", nil, nil)
---
SELECT "rooms".* FROM "rooms" WHERE (participant_1_id = NULL AND participant_2_id < NULL)

  def create
    passcode = request.headers["Passcode"]
    user = User.find_by(passcode: passcode)
    code = ''
    participant1 = nil
    participant2 = nil
    loop do
      code = SecureRandom.urlsafe_base64(16)
      break code unless Room.exists?(:name => code)
    end
    roomname = code
    if params.key?(:target)
      participant1 = user.id
      participant2 = params[:target]
    else
      roomname = params[:name]
    end
    newRoom = Room.create(name: roomname, code: code, participant_1_id: participant1, participant_2_id: participant2)
---
SELECT "users".* FROM "users" WHERE "users"."passcode" = '_6yPsu7tp-4' LIMIT 1
SELECT 1 AS one FROM "rooms" WHERE "rooms"."name" = 'fXYA0xlxpmS4CmM40FsaMw' LIMIT 1
INSERT INTO "rooms" ("name", "participant_1_id", "participant_2_id", "created_at", "updated_at") VALUES ('fXYA0xlxpmS4CmM40FsaMw', 2, 1, '2025-05-23 11:53:21.156567', '2025-05-23 11:53:21.156567') RETURNING "id"